---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.Hub
source: html/4a97420f-721f-17e4-e978-8378e89957a5.htm
---
# Hub Properties

The id of the assembly instance to which the element belongs.